OSPF(Open Shortest Path First开放式最短路径优先协议，OSPF是链路状态协议  <br>
RIP(Routing Information Protocols,路由信息协议)，RIP是距离矢量协议  <br>
ACLs的全称为接入控制列表（Access Control Lists），也称访问控制列表（Access Lists），俗称防火墙
```
Router(config)# enable secret 123456                                #设置特权密码，运行show run命令不会明码显示
Router(config)# interface fastEthernet 0/0.1                        #代表0号物理接口上的1号虚拟子接口
(划分子接口：多个vlan要通信，它们各自的网段不同，网关也不同，而交换机只连接路由器上的一个物理接口，
这个接口不可能直接配置多个地址，所以划分多个虚拟子接口，就可以配置多个地址作为vlan的网关地址)
Router(config)# encapsulation dot1Q 2                               #配置以太网子接口vlan 2号，封装格式为802.1q
Router(config)# interface serial 0/0/0                              #进入串口0/0/0的配置界面
Router(config)# clock rate 64000                                    #设置时钟速率的命令,如果本端口连接的是DCE线缆,则要设同步时钟频率
Router(config)# ip route 192.168.1.0 255.255.255.0 192.168.3.1      #静态路由设置，把发送到192.168.1.0/24的包交给192.168.3.1
Router(config)# router rip                                          #开启动态的路由信息协议(rip)
Router(config-router)# network 192.168.2.0                                  
Router(config-router)# network 192.168.3.0                          #添加本路由不同VLAN的网络地址，打通数据包的转发能力

Router(config)# router ospf 1                                       #启动OSPF进程
Router(config-router)# router-id 1.1.1.1                            #配置路由器ID
(区域ID是0-4294967295的数，也可以是IP地址的格式A.B.C.D。当网络区域为0或0.0.0.0时称为主干区域)
Router# show ip route ospf 1                                        #查看OSPF路由表
Router# show  ip protocols                                          #查看启用的路由协议
Router# show running-config                                         #查看当前运行的配置信息
Router(config-router)# network 192.168.2.0 0.0.0.255 area 0
Router(config-router)# network 192.168.4.0 0.0.0.255 area 0         #添加本路由不同VLAN的网络地址，打通数据包的转发能力

Router(config)# router rip
Router(config-router)# redistribute ospf 1 metric 50                #向RIP中重分布OSPF
Router(config)# router ospf 1
Router(config-router)# redistribute rip subnets                     #向OSPF中重分布RIP

Router(config)# ip access-list standard abcd                        #选用标准的访问列表
 ---standard只能定义IP地址或网段，一般用于管理流量或路由过滤
 ---extended可以定义源目IP，协议，端口，一般用于数据层面流量过滤

Router(config-std-nacl)# permit 192.168.1.0 0.0.0.255               #允许访问Internet的网段为192.168.1.0~192.168.1.255，
反掩码为0.0.0.255；反掩码与掩码的关系为：反掩码+子网掩码=255.255.255.255
Router(config-std-nacl)# deny 192.168.2.0 0.0.0.255                 #拒绝访问Internet的网段设置

Router(config)# int serial 2/0
Router(config-if)# ip access-group abcd out                         #将列表abcd所定义的条件应用禁止从此接口出去
(in为过滤入口的包；out为过滤出口的包)

Router(config-if)# ip nat inside                                    #路由器来说是局域网，一般是私有地址连接口
Router(config-if)# ip nat outside                                   #路由器来说是广域网，一般是公有地址连接口
 ---对于路由器来说inside对应的是access-list；outside对应的是转换地址池pool
 ---Inside local 内部本地地址（内部主机的实际地址，一般为私有地址）
 ---Inside global 内部全局地址（内部主机经NAT转换后去往外部的地址，是ISP分配的合法IP地址）
 ---Outside local 外部本地地址（外部主机由NAT设备转换后的地址，一般为私有地址）
 ---Outside global 外部全局地址（外部主机的真实地址，互联网上的合法IP地址）
Router(config)# ip nat inside source static 192.168.1.2 222.0.1.3   #设置NAT地址，192.168.1.2是内网地址，映射的外网地址是222.0.1.3
Router# show ip nat statistics                                      #查看NAT转换的统计状态信息
Router# show ip nat translations                                    #查看NAT表
Router# clear ip nat translation *                                  #清除动态NAT表
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255          #只允许IP为 192.168.1.1 ~ 192.168.1.255 的数据包通过
Router(config)# ip nat pool gjsy 200.1.1.3 200.1.1.3 netmask 255.255.255.0  #NAT池转换的IP的范围，相同说明只能转换一个地址出去
```
